0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];  // kg m s K mol A cd

internalField   uniform (0 0 0);

boundaryField
{
    inlet1
    {
        type            fixedValue;
        value           uniform (754.6 0 0); // Mach 2.2

    }

    outlet1
    {
        type            zeroGradient;
    }

    
    bottom 
    {
        type            symmetryPlane;
    }
    
    
    wall1
    {
        type            slip;
    }

    top
    {
        type            zeroGradient;
    };
    

    bottomEmptyFaces
    {
        type            empty;
    }
    
    topEmptyFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
