system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// used in conjunction with the cfMesh, this case, cartesian2DMesh

surfaceFile "Combined.fms" 

// minCellSize .0001;
minCellSize .00001;


// maxCellSize .0005;
maxCellSize .0005;



// boundaryCellSize .0001;

// ************************************************************************* //
